[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:46:23
           type="text"
           isInvalid={Boolean(errors.itemId)}
           {...register("itemId", {
-            required: "Item ID is required.",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Item ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:61:41
           id="reviewerEmail"
           type="text"
           isInvalid={Boolean(errors.reviewerEmail)}
-          {...register("reviewerEmail", {
-            required: "Reviewer Email is required.",
-          })}
+          {...register("reviewerEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:77:33
           id="stars"
           type="text"
           isInvalid={Boolean(errors.stars)}
-          {...register("stars", {
-            required: "Stars is required.",
-          })}
+          {...register("stars", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:91:39
           Date Reviewed (iso format)
         </Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-dateReviewed"}
+          data-testid={testIdPrefix + ""}
           id="dateReviewed"
           type="datetime-local"
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-dateReviewed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:95:40
           id="dateReviewed"
           type="datetime-local"
           isInvalid={Boolean(errors.dateReviewed)}
-          {...register("dateReviewed", {
-            required: "Date Reviewed is required.",
-          })}
+          {...register("dateReviewed", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:96:23
           type="datetime-local"
           isInvalid={Boolean(errors.dateReviewed)}
           {...register("dateReviewed", {
-            required: "Date Reviewed is required.",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:112:23
           type="text"
           isInvalid={Boolean(errors.comments)}
           {...register("comments", {
-            required: "Comments is required.",
+            required: "",
             maxLength: {
               value: 255,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Comments is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
