[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:15:18
 export default function MenuItemReviewTable({
   menuItemReviews,
   currentUser,
-  testIdPrefix = "MenuItemReviewTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] BlockStatement
main/components/MenuItemReviews/MenuItemReviewTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/menuitemreviews/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/menuitemreviews/edit/2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:44:15
     },
 
     {
-      header: "Item ID",
+      header: "",
       accessorKey: "itemId",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Item ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:47:5
       header: "Item ID",
       accessorKey: "itemId",
     },
-    {
-      header: "Reviewer Email",
-      accessorKey: "reviewerEmail",
-    },
+    {},
     {
       header: "Stars",
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:52:15
       accessorKey: "reviewerEmail",
     },
     {
-      header: "Stars",
+      header: "",
       accessorKey: "stars",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Stars. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:56:15
       accessorKey: "stars",
     },
     {
-      header: "Date Reviewed",
+      header: "",
       accessorKey: "dateReviewed",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Date Reviewed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:60:15
       accessorKey: "dateReviewed",
     },
     {
-      header: "Comments",
+      header: "",
       accessorKey: "comments",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Comments. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:61:20
     },
     {
       header: "Comments",
-      accessorKey: "comments",
+      accessorKey: "",
     },
   ];
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-comments"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
