[Killed] BooleanLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:7:65
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function MenuItemReviewsCreatePage({ storybook = false }) {
+export default function MenuItemReviewsCreatePage({ storybook = true }) {
   const objectToAxiosParams = (review) => ({
     url: "/api/MenuItemReview/post",
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/menuitemreviews' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (review) => ({
-    url: "/api/MenuItemReview/post",
-    method: "POST",
-    params: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:8:44
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (review) => ({
-    url: "/api/MenuItemReview/post",
-    method: "POST",
-    params: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosParams = (review) => ({});
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:10:13
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (review) => ({
     url: "/api/MenuItemReview/post",
-    method: "POST",
+    method: "",
     params: {
       itemId: review.itemId,
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:20:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(`New review Created - id: ${review.id} itemId: ${review.itemId}`);
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:37:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/menuitemreviews" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/menuitemreviews' } ]

Number of calls: 0
