[Killed] BooleanLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:8:63
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function MenuItemReviewsEditPage({ storybook = false }) {
+export default function MenuItemReviewsEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/menuitemreviews' } ]

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:21:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/MenuItemReview`,
+      url: ``,
       params: {
         id,
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/MenuItemReview",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Review Updated - id: 17 itemId: 18",

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:28:55
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/MenuItemReview",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosPutParams = (menuItemReview) => ({});
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Review Updated - id: 17 itemId: 18",

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (menuItemReview) => ({
     url: "/api/MenuItemReview",
-    method: "PUT",
+    method: "",
     params: {
       id: menuItemReview.id,
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Review Updated - id: 17 itemId: 18",

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:34:11
     params: {
       id: menuItemReview.id,
     },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
+    data: {},
   });
 
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected '{}' to be '{"itemId":"18","reviewerEmail":"johnn…' // Object.is equality

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:43:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `Review Updated - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:45:7
 
   const onSuccess = (menuItemReview) => {
     toast(
-      `Review Updated - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`,
+      ``,
     );
   };
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Review Updated - id: 17 itemId: 18",

[Killed] LogicalOperator
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItemReview}
-          />
-        )}
+        {menuItemReview || <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={menuItemReview} />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItemReview}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
