[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(`Help Request Updated - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`);
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:45:11
   });
 
   const onSuccess = (helpRequest) => {
-    toast(`Help Request Updated - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`);
+    toast(``);
   };
 
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Help Request Updated - id: 17 requesterEmail: test@example.com",
