[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:8:17
 function UCSBOrganizationForm({
   initialContents,
   submitAction = () => {},
-  buttonLabel = "Create",
+  buttonLabel = "",
 }) {
   const navigate = useNavigate();
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:11:24
   buttonLabel = "Create",
 }) {
   const navigate = useNavigate();
-  const testIdPrefix = "UCSBOrganizationForm";
+  const testIdPrefix = "";
 
   // Build defaultValues without conditional object literals that Stryker mutates easily
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:15:9
 
   // Build defaultValues without conditional object literals that Stryker mutates easily
   const defaultValues = {
-    ...(initialContents ?? {}),
+    ...(initialContents && {}),
     inactive:
       initialContents?.inactive === undefined
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(vsa)

Expected the element to have value:
  vsa
Received:

[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:17:7
   const defaultValues = {
     ...(initialContents ?? {}),
     inactive:
-      initialContents?.inactive === undefined
+      initialContents.inactive === undefined
         ? ""
         : String(initialContents.inactive),
killedBy: UCSBOrganizationCreatePage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'inactive')

[Killed] EqualityOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:17:7
   const defaultValues = {
     ...(initialContents ?? {}),
     inactive:
-      initialContents?.inactive === undefined
+      initialContents?.inactive !== undefined
         ? ""
         : String(initialContents.inactive),
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'inactive')

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:26:15
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({ defaultValues });
+  } = useForm({});
 
   return (
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(tt)

Expected the element to have value:
  tt
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:34:24
         <Form.Label>Short Organization Translation</Form.Label>
         <Form.Control
           data-testid="UCSBOrganizationForm-orgTranslationShort"
-          {...register("orgTranslationShort", {
+          {...register("", {
             required: "Short Translation Organization is required.",
             maxLength: { value: 255, message: "Max length 255 characters" },
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:39:10
             maxLength: { value: 255, message: "Max length 255 characters" },
           })}
         />
-        {errors.orgTranslationShort?.message && (
+        {errors.orgTranslationShort.message && (
           <div className="text-danger">
             {errors.orgTranslationShort.message}
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:39:10
             maxLength: { value: 255, message: "Max length 255 characters" },
           })}
         />
-        {errors.orgTranslationShort?.message && (
-          <div className="text-danger">
-            {errors.orgTranslationShort.message}
-          </div>
-        )}
+        {errors.orgTranslationShort?.message || <div className="text-danger">
+            {errors.orgTranslationShort.message}
+          </div>}
       </Form.Group>
 
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:52:47
           data-testid="UCSBOrganizationForm-orgCode"
           {...register("orgCode", {
             required: "OrgCode is required.",
-            maxLength: { value: 255, message: "Max length 255 characters" },
+            maxLength: { value: 255, message: "" },
           })}
         />
killedBy: UCSBOrganizationForm tests orgCode validations: required and maxLength are enforced and displayed
statusReason: Unable to find an element with the text: Max length 255 characters. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:55:10
             maxLength: { value: 255, message: "Max length 255 characters" },
           })}
         />
-        {errors.orgCode?.message && (
-          <div className="text-danger">{errors.orgCode.message}</div>
-        )}
+        {true}
       </Form.Group>
 
killedBy: UCSBOrganizationForm tests orgCode validations: required and maxLength are enforced and displayed
statusReason: Unable to find an element with the text: OrgCode is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:55:10
             maxLength: { value: 255, message: "Max length 255 characters" },
           })}
         />
-        {errors.orgCode?.message && (
-          <div className="text-danger">{errors.orgCode.message}</div>
-        )}
+        {false}
       </Form.Group>
 
killedBy: UCSBOrganizationForm tests orgCode validations: required and maxLength are enforced and displayed
statusReason: Unable to find an element with the text: OrgCode is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:64:42
         <Form.Label>Organization Name</Form.Label>
         <Form.Control
           data-testid="UCSBOrganizationForm-orgTranslation"
-          {...register("orgTranslation", {
-            required: "Organization Translation is required.",
-          })}
+          {...register("orgTranslation", {})}
         />
         {errors.orgTranslation?.message && (
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization Translation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:64:24
         <Form.Label>Organization Name</Form.Label>
         <Form.Control
           data-testid="UCSBOrganizationForm-orgTranslation"
-          {...register("orgTranslation", {
+          {...register("", {
             required: "Organization Translation is required.",
           })}
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:68:10
             required: "Organization Translation is required.",
           })}
         />
-        {errors.orgTranslation?.message && (
-          <div className="text-danger">{errors.orgTranslation.message}</div>
-        )}
+        {true}
       </Form.Group>
 
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization Translation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:68:10
             required: "Organization Translation is required.",
           })}
         />
-        {errors.orgTranslation?.message && (
+        {errors.orgTranslation.message && (
           <div className="text-danger">{errors.orgTranslation.message}</div>
         )}
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:77:36
         <Form.Label>Inactive</Form.Label>
         <Form.Select
           data-testid="UCSBOrganizationForm-inactive"
-          {...register("inactive", {
-            setValueAs: (v) => (v === "" ? undefined : v === "true"),
-            validate: (v) =>
-              v === true || v === false || "Inactive status is required.",
-          })}
+          {...register("inactive", {})}
         >
           <option value="">-- Select --</option>
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Inactive status is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:78:56
         <Form.Select
           data-testid="UCSBOrganizationForm-inactive"
           {...register("inactive", {
-            setValueAs: (v) => (v === "" ? undefined : v === "true"),
+            setValueAs: (v) => (v === "" ? undefined : v !== "true"),
             validate: (v) =>
               v === true || v === false || "Inactive status is required.",
killedBy: UCSBOrganizationForm tests calls submitAction when all fields are valid
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Anything ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:78:33
         <Form.Select
           data-testid="UCSBOrganizationForm-inactive"
           {...register("inactive", {
-            setValueAs: (v) => (v === "" ? undefined : v === "true"),
+            setValueAs: (v) => (true ? undefined : v === "true"),
             validate: (v) =>
               v === true || v === false || "Inactive status is required.",
killedBy: UCSBOrganizationForm tests calls submitAction when all fields are valid
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:79:23
           data-testid="UCSBOrganizationForm-inactive"
           {...register("inactive", {
             setValueAs: (v) => (v === "" ? undefined : v === "true"),
-            validate: (v) =>
-              v === true || v === false || "Inactive status is required.",
+            validate: () => undefined,
           })}
         >
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Inactive status is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:80:15
           {...register("inactive", {
             setValueAs: (v) => (v === "" ? undefined : v === "true"),
             validate: (v) =>
-              v === true || v === false || "Inactive status is required.",
+              false,
           })}
         >
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Inactive status is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:80:15
           {...register("inactive", {
             setValueAs: (v) => (v === "" ? undefined : v === "true"),
             validate: (v) =>
-              v === true || v === false || "Inactive status is required.",
+              false || "Inactive status is required.",
           })}
         >
killedBy: UCSBOrganizationForm tests calls submitAction when all fields are valid
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:87:10
           <option value="true">True</option>
           <option value="false">False</option>
         </Form.Select>
-        {errors.inactive?.message && (
+        {errors.inactive.message && (
           <div className="text-danger">{errors.inactive.message}</div>
         )}
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:87:10
           <option value="true">True</option>
           <option value="false">False</option>
         </Form.Select>
-        {errors.inactive?.message && (
-          <div className="text-danger">{errors.inactive.message}</div>
-        )}
+        {errors.inactive?.message || <div className="text-danger">{errors.inactive.message}</div>}
       </Form.Group>
 
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
