[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:21:34
     params: { orgCode },
   });
 
-  const objectToAxiosPutParams = (data) => ({
-    url: "/api/UCSBOrganization",
-    method: "PUT",
-    params: {
-      orgCode: orgCode, // The 'orgCode' from the URL
-    },
-    data: {
-      orgTranslationShort: data.orgTranslationShort,
-      orgTranslation: data.orgTranslation,
-      inactive: data.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (UCSBOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:36:7
 
   const onSuccess = (UCSBOrganization) => {
     toast(
-      `UCSBOrganization Updated - orgCode: ${UCSBOrganization.orgCode} orgTranslation: ${UCSBOrganization.orgTranslation}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: vsa orgTranslation: UCSB Vietnamese Student Association",

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:40:63
     );
   };
 
-  const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
+  const mutation = useBackendMutation(objectToAxiosPutParams, {}, [
     `/api/UCSBOrganization?orgCode=${orgCode}`,
   ]);
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:41:5
   };
 
   const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
-    `/api/UCSBOrganization?orgCode=${orgCode}`,
+    ``,
   ]);
 
killedBy: UCSBOrganizationEditPage tests hook wiring calls useBackend and useBackendMutation with correct args
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, Any<Object>, …(1) ]

Received: 

  1st useBackendMutation call:

  [
-   Any<Function>,
