[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:150:61
 
       <Row>
         <Col>
-          <Button type="submit" data-testid={testIdPrefix + "-submit"}>
+          <Button type="submit" data-testid={testIdPrefix + ""}>
             {buttonLabel}
           </Button>
killedBy: ArticlesForm tests that all form fields have correct test ids
statusReason: Unable to find an element by: [data-testid="ArticlesForm-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
