[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:141:24
           type="checkbox"
           label="Solved"
           id="solved"
-          {...register("solved")}
+          {...register("")}
         />
       </Form.Group>
killedBy: HelpRequestsForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')
