[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:61:42
           id="professorEmail"
           type="email"
           isInvalid={Boolean(errors.professorEmail)}
-          {...register("professorEmail", {
-            required: "Professor email is required.",
-          })}
+          {...register("professorEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Professor email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:94:23
           type="datetime-local"
           isInvalid={Boolean(errors.dateRequested)}
           {...register("dateRequested", {
-            required: "Date requested is required.",
+            required: "",
           })}
         />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
