[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:63:15
       accessorKey: "dateNeeded",
     },
     {
-      header: "Done",
+      header: "",
       accessorKey: "done",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Done. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"
