[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:10:25
   submitAction,
   buttonLabel = "Create",
 }) {
-  const defaultValues = initialContents || {};
+  const defaultValues = false;
 
   // Stryker disable all
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(vsa)

Expected the element to have value:
  vsa
Received:

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:10:25
   submitAction,
   buttonLabel = "Create",
 }) {
-  const defaultValues = initialContents || {};
+  const defaultValues = initialContents && {};
 
   // Stryker disable all
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(vsa)

Expected the element to have value:
  vsa
Received:

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:48:24
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
             required: "Short Translation Organization is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:82:36
           id="inactive"
           as="select"
           isInvalid={Boolean(errors.inactive)}
-          {...register("inactive", {
-            required: "Inactive status is required.",
-          })}
+          {...register("inactive", {})}
         >
           <option value="">-- Select --</option>
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Inactive status is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:83:23
           as="select"
           isInvalid={Boolean(errors.inactive)}
           {...register("inactive", {
-            required: "Inactive status is required.",
+            required: "",
           })}
         >
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Inactive status is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
