[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/UCSBOrganization/edit/${cell.row.original.orgCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/UCSBOrganization/edit/vsa' ]

Number of calls: 0

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:39:15
 
   const columns = [
     {
-      header: "orgCode",
+      header: "",
       accessorKey: "orgCode", // accessor is the "key" in the data
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: orgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
