[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:10:31
 export default function UCSBDiningCommonsMenuItemCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (ucsbdiningcommonsmenuitem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-      name: ucsbdiningcommonsmenuitem.name,
-      station: ucsbdiningcommonsmenuitem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend and redirects
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:13:13
   const objectToAxiosParams = (ucsbdiningcommonsmenuitem) => ({
     url: "/api/UCSBDiningCommonsMenuItem/post",
     method: "POST",
-    params: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-      name: ucsbdiningcommonsmenuitem.name,
-      station: ucsbdiningcommonsmenuitem.station,
-    },
+    params: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend and redirects
statusReason: expected {} to deeply equal { diningCommonsCode: 'dlg', …(2) }

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:20:52
     },
   });
 
-  const onSuccess = (ucsbdiningcommonsmenuitem) => {
-    toast(
-      `New UCSBDiningCommonsMenuItem Created - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`,
-    );
-  };
+  const onSuccess = (ucsbdiningcommonsmenuitem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend and redirects
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:22:7
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
     toast(
-      `New UCSBDiningCommonsMenuItem Created - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`,
+      ``,
     );
   };
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend and redirects
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New UCSBDiningCommonsMenuItem Created - id: 17 name: Chicken Bowl",
