[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:16:6
     _error,
     _status,
   } = useBackend(
-    [`/api/UCSBDiningCommonsMenuItem?id=${id}`],
+    [``],
     {
       url: "/api/UCSBDiningCommonsMenuItem",
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected undefined to be defined

[Killed] ArrayDeclaration
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:16:5
     _error,
     _status,
   } = useBackend(
-    [`/api/UCSBDiningCommonsMenuItem?id=${id}`],
+    [],
     {
       url: "/api/UCSBDiningCommonsMenuItem",
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:17:5
     _status,
   } = useBackend(
     [`/api/UCSBDiningCommonsMenuItem?id=${id}`],
-    {
-      url: "/api/UCSBDiningCommonsMenuItem",
-      params: {
-        id,
-      },
-    },
+    {},
     null,
   );
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:26:34
     null,
   );
 
-  const objectToAxiosPutParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem",
-    method: "PUT",
-    params: {
-      id: menuItem.id,
-    },
-    data: {
-      diningCommonsCode: menuItem.diningCommonsCode,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:26:49
     null,
   );
 
-  const objectToAxiosPutParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem",
-    method: "PUT",
-    params: {
-      id: menuItem.id,
-    },
-    data: {
-      diningCommonsCode: menuItem.diningCommonsCode,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = (menuItem) => ({});
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:27:10
   );
 
   const objectToAxiosPutParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:28:13
 
   const objectToAxiosPutParams = (menuItem) => ({
     url: "/api/UCSBDiningCommonsMenuItem",
-    method: "PUT",
+    method: "",
     params: {
       id: menuItem.id,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:39:35
     },
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`UCSBDiningCommonsMenuItem Updated - id: ${menuItem.id}`);
-  };
+  const onSuccess = (menuItem) => {};
 
   const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess });
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:51:18
     mutation.mutate(data);
   };
 
-  if (isSuccess) {
-    return <Navigate to="/diningcommonsmenuitem" />;
-  }
+  if (isSuccess) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/diningcommonsmenuitem' } ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:59:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {menuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            initialContents={menuItem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:59:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {menuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            initialContents={menuItem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
