[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (UCSBOrganization) => ({
-    url: "/api/UCSBOrganization/post",
-    method: "POST",
-    params: {
-      orgCode: UCSBOrganization.orgCode,
-      orgTranslationShort: UCSBOrganization.orgTranslationShort,
-      orgTranslation: UCSBOrganization.orgTranslation,
-      inactive: UCSBOrganization.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBOrganization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:19:43
     },
   });
 
-  const onSuccess = (UCSBOrganization) => {
-    toast(
-      `New UCSBOrganization Created - orgCode: ${UCSBOrganization.orgCode} orgTranslation: ${UCSBOrganization.orgTranslation}`,
-    );
-  };
+  const onSuccess = (UCSBOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:21:7
 
   const onSuccess = (UCSBOrganization) => {
     toast(
-      `New UCSBOrganization Created - orgCode: ${UCSBOrganization.orgCode} orgTranslation: ${UCSBOrganization.orgTranslation}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "New UCSBOrganization Created - orgCode: vsa orgTranslation: Vietamese Student Assocation",

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:34:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    const transformedData = {
-      ...data,
-      // This converts "true" to true and "false" to false
-      inactive: data.inactive === "true",
-    };
-    mutation.mutate(transformedData);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:35:29
   const { isSuccess } = mutation;
 
   const onSubmit = async (data) => {
-    const transformedData = {
-      ...data,
-      // This converts "true" to true and "false" to false
-      inactive: data.inactive === "true",
-    };
+    const transformedData = {};
     mutation.mutate(transformedData);
   };
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: expected { orgCode: undefined, …(3) } to deeply equal { orgCode: 'vsa', …(3) }

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:38:17
     const transformedData = {
       ...data,
       // This converts "true" to true and "false" to false
-      inactive: data.inactive === "true",
+      inactive: false,
     };
     mutation.mutate(transformedData);
killedBy: UCSBOrganizationCreatePage tests on submit, when inactive is 'true' string, sends inactive=true to backend
statusReason: expected { orgCode: 'acm', …(3) } to deeply equal { orgCode: 'acm', …(3) }

[Killed] EqualityOperator
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:38:17
     const transformedData = {
       ...data,
       // This converts "true" to true and "false" to false
-      inactive: data.inactive === "true",
+      inactive: data.inactive !== "true",
     };
     mutation.mutate(transformedData);
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: expected { orgCode: 'vsa', …(3) } to deeply equal { orgCode: 'vsa', …(3) }
