[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:15:19
     data: UCSBOrganization,
     _error,
     _status,
-  } = useBackend([`/api/UCSBOrganization?orgCode=${orgCode}`], {
+  } = useBackend([``], {
     method: "GET",
     url: `/api/UCSBOrganization`,
killedBy: UCSBOrganizationEditPage tests hook wiring calls useBackend and useBackendMutation with correct args
statusReason: expected "useBackend" to be called with arguments: [ …(2) ]

Received:

  1st useBackend call:

@@ -1,10 +1,10 @@
  [

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:18:13
   } = useBackend([`/api/UCSBOrganization?orgCode=${orgCode}`], {
     method: "GET",
     url: `/api/UCSBOrganization`,
-    params: { orgCode },
+    params: {},
   });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:21:34
     params: { orgCode },
   });
 
-  const objectToAxiosPutParams = (data) => ({
-    url: "/api/UCSBOrganization",
-    method: "PUT",
-    params: {
-      orgCode: orgCode, // The 'orgCode' from the URL
-    },
-    data: {
-      orgCode: data.orgCode,
-      orgTranslationShort: data.orgTranslationShort,
-      orgTranslation: data.orgTranslation,
-      inactive: data.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (UCSBOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:35:43
     },
   });
 
-  const onSuccess = (UCSBOrganization) => {
-    toast(
-      `UCSBOrganization Updated - orgCode: ${UCSBOrganization.orgCode} orgTranslation: ${UCSBOrganization.orgTranslation}`,
-    );
-  };
+  const onSuccess = (UCSBOrganization) => {};
 
   const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:59:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {UCSBOrganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={UCSBOrganization}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:59:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {UCSBOrganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={UCSBOrganization}
-          />
-        )}
+        {UCSBOrganization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={UCSBOrganization} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(vsa)

Expected the element to have value:
  vsa
Received:
