[Killed] BlockStatement
src/main/utils/UCSBDiningCommonsMenuItemUtils.js:13:39
   };
 };
 
-const onDeleteSuccess = (response) => {
-  console.log(response);
-  toast(response.message);
-};
+const onDeleteSuccess = (response) => {};
 
 export { cellToAxiosParamsDelete, onDeleteSuccess };
killedBy: UCSBDiningCommonsMenuItemIndexPage tests delete works for admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
