[Killed] BlockStatement
src/main/utils/recommendationRequestUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast(message.message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: recommendationRequestUtils onDeleteSuccess
statusReason: expected "log" to be called with arguments: [ Array(1) ]

Number of calls: 0
